code-review/NRB_3471_3546/База_Стало/Reports/РегистрСубклиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РегистрСубклиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДепонентов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСубклиентов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/Субклиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Субклиенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОбслуживанияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОбслуживанияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРоссийскийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПаспортныеДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанныеФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ГражданствоФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Владельца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВладельцаТорговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВладельцаТранзитный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправляющегоТорговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залогодержателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционногоТоварищества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИностранногоНоминальногоДержателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИностранногоНоминальногоДержателяТорговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИностранногоУполномоченногоДержателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИностранногоУполномоченногоДержателяТорговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеФедеральныеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КазначейскийСчетЭмитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСчетДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСчетДЕПО_КСУ_GC_Bonds</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСчетДЕПО_КСУ_GC_Expanded</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСчетДЕПО_КСУ_GC_Shares</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеустановленныхЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоминальногоДержателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоминальногоДержателяТорговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетПравНаЦБПереданныеВДепозитНотариусаСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭмиссионныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНеПредназначенныйДляУчетаПравНаЦБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ПризнакиСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетДепонента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОПопечителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МежДепозитарный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/РегистрСубклиентов/Ext/ObjectModule.bsl
// Формирует отчет в табличный документ из параметра
//
// Параметры:
//  Таблица - Табличный документ - табличный документ результата
//
Процедура СформироватьОтчет(Таблица) Экспорт
	
	Таблица.Очистить();
	Макет = ПолучитьМакет("РегистрСубклиентов");
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.НазваниеОтчета = "Регистр субклиентов за период с " + Формат(НачалоПериода, "ДЛФ=Д")
		+ " по " + Формат(КонецПериода, "ДЛФ=Д");
	Таблица.Вывести(ОбластьШапка);
	
	ТекущийСубклиент = Неопределено;
	ПредыдущиеДанные = Неопределено;
	НомерСтроки = 0;
	ДанныеПоСубклиентам = ДанныеПоСубклиентам();
	Выборка = ДанныеПоСубклиентам[4].Выбрать();
	ДанныеДУСубклиентов = ДанныеПоСубклиентам[5].Выгрузить();
	ТекстКлиент = "";
	ТекстДоговор = "";
	Пока Выборка.Следующий() Цикл
		ДанныеЗаполнения = НовыеДанныеЗаполнения();
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
		Если ТипЗнч(Выборка.Субклиент) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
			ДанныеЗаполнения.КраткоеНаименование = Выборка.КраткоеНаименование;
			ДанныеЗаполнения.Документ = ОГРН(Выборка.ОГРН, Выборка.ДатаГосРегистрации, Выборка.Резидент);
		ИначеЕсли ТипЗнч(Выборка.Субклиент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ДанныеЗаполнения.КраткоеНаименование = ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(Выборка.Фамилия, Выборка.Имя, Выборка.Отчество);
			ДанныеЗаполнения.Документ = ПредставлениеДокументаФизлица(Выборка.Наименование, Выборка, Выборка.ДатаИзменения);
			ДанныеЗаполнения.Гражданство = ПредставлениеГражданстваФизлица(Выборка.Наименование, Выборка.Гражданство, Выборка.ДатаИзменения);
			ДанныеЗаполнения.ДатаМестоРождения = СтрокаИзДаты(Выборка.ДатаРождения);
			Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
				ДанныеЗаполнения.ДатаМестоРождения = ДанныеЗаполнения.ДатаМестоРождения + ", " + Выборка.МестоРождения;
			КонецЕсли;
		КонецЕсли;
		Если ТекущийСубклиент <> Выборка.Субклиент Тогда
			НомерСтроки = НомерСтроки+1;
			ДанныеЗаполнения.НомерДепонента = НомерСтроки;
			ТекущийСубклиент = Выборка.Субклиент;
			Для Каждого ТекПоле Из ДанныеЗаполнения Цикл
				ОбластьСтрока.Области[ТекПоле.Ключ].ЦветФона = ЦветаСтиля.ЦветФонаПоля;
			КонецЦикла;
			
			ТекстКлиент = "";
			ТекстДоговор = "";
			Отбор = Новый Структура("Субклиент", Выборка.Субклиент);
			ДУПоТекущемуСубклиенту = ДанныеДУСубклиентов.НайтиСтроки(Отбор);
			Для Каждого Стр Из ДУПоТекущемуСубклиенту Цикл
				ТекстКлиент = ТекстКлиент + СокрЛП(Стр.ДУ) + ";" + Символы.ПС;
				ТекстДоговор = ТекстДоговор + СокрЛП(Стр.ДоговорДУ) + ";" + Символы.ПС;
			КонецЦикла;
			ТекстКлиент = Лев(ТекстКлиент, СтрДлина(ТекстКлиент)-2);
			ТекстДоговор = Лев(ТекстДоговор, СтрДлина(ТекстДоговор)-2);
		Иначе
			ДанныеЗаполнения.НомерДепонента = "";
			
			ПоляБезОтображенияИзменений = Новый Массив;
			ПоляБезОтображенияИзменений.Добавить("НомерДепонента");
			ПоляБезОтображенияИзменений.Добавить("ДатаИзменения");
			ПоляБезОтображенияИзменений.Добавить("Клиент");
			ПоляБезОтображенияИзменений.Добавить("Договор");
			
			Для Каждого ТекПоле Из ДанныеЗаполнения Цикл
				Если ПоляБезОтображенияИзменений.Найти(ТекПоле.Ключ) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ТекЦветФона = ?(ТекПоле.Значение <> ПредыдущиеДанные[ТекПоле.Ключ], ЦветаСтиля.ЦветНавигации, ЦветаСтиля.ЦветФонаПоля);
				ОбластьСтрока.Области[ТекПоле.Ключ].ЦветФона = ТекЦветФона;
			КонецЦикла;
		КонецЕсли;
		ДанныеЗаполнения.Клиент = ТекстКлиент;
		ДанныеЗаполнения.Договор = ТекстДоговор;
		ПредыдущиеДанные = ДанныеЗаполнения;
		ОбластьСтрока.Параметры.Заполнить(ДанныеЗаполнения);
		Таблица.Вывести(ОбластьСтрока);
	КонецЦикла; 
	
КонецПроцедуры

Функция ДанныеПоСубклиентам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоСубклиентам();
	Запрос.УстановитьПараметр("НачалоПериода",			НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			КонецПериода);
	Запрос.УстановитьПараметр("СписокДепонентов",		СписокДепонентов);
	Запрос.УстановитьПараметр("СписокДепонентовПуст",	Не ЗначениеЗаполнено(СписокДепонентов));
	Запрос.УстановитьПараметр("СписокСубклиентов",		СписокСубклиентов);
	Запрос.УстановитьПараметр("СписокСубклиентовПуст",	Не ЗначениеЗаполнено(СписокСубклиентов));
	Запрос.УстановитьПараметр("ТипСчетаДУ",				Перечисления.ТипыСчетовДепо.ДоверительногоУправляющего);
	Запрос.УстановитьПараметр("ПризнакСчетДепонента",	Перечисления.ПризнакиСчетаДепо.СчетДепонента);
	Запрос.УстановитьПараметр("ТипДоговораДепозитарный", Перечисления.ТипыДоговоров.Депозитарный);
	Запрос.УстановитьПараметр("Адрес",				Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Телефон",			Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("АдресЭлектроннойПочты",	Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ФактАдресЮрЛица",	Справочники.ВидыКонтактнойИнформации.ФактАдресЮрЛица);
	Запрос.УстановитьПараметр("ФактАдресФизЛица",	Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ЮрАдресЮрЛица",		Справочники.ВидыКонтактнойИнформации.ЮрАдресЮрЛица);
	Запрос.УстановитьПараметр("ЮрАдресФизЛица",		Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("EmailЮрЛица",		Справочники.ВидыКонтактнойИнформации.EmailЮрЛица);
	Запрос.УстановитьПараметр("EmailФизЛица",		Справочники.ВидыКонтактнойИнформации.EmailФизЛица);
	Запрос.УстановитьПараметр("ТелефонЮрЛица",		Справочники.ВидыКонтактнойИнформации.ТелефонЮрЛица);
	Запрос.УстановитьПараметр("ТелефонФизЛица",		Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	Результаты = Запрос.ВыполнитьПакет();
	Возврат Результаты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция НовыеДанныеЗаполнения()
	
	Возврат Новый Структура("НомерДепонента, ДатаИзменения, КраткоеНаименование, Наименование, Документ,
	|Гражданство, ИНН, ЮридическийАдрес, ФактическийАдрес, ДатаМестоРождения, Телефон, Email, Резидент, Клиент, Договор");
	
КонецФункции

Функция ТекстЗапросаПоСубклиентам()
	
	Возврат
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Депонент,
	|	МАКСИМУМ(Договоры.Ссылка) КАК Договор
	|ПОМЕСТИТЬ втДепоненты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО Контрагенты.Ссылка = СчетаДепо.Владелец
	|			И (СчетаДепо.ДатаОткрытияСчета <= &КонецПериода)
	|			И (СчетаДепо.ДатаЗакрытияСчета = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ СчетаДепо.ДатаЗакрытияСчета > &НачалоПериода)
	|			И (СчетаДепо.ПризнакСчетаДепо = &ПризнакСчетДепонента)
	|			И (НЕ СчетаДепо.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО Контрагенты.Ссылка = Договоры.Владелец
	|			И (Договоры.ТипДоговора = &ТипДоговораДепозитарный)
	|			И (Договоры.ДатаНачалоДействия <= &КонецПериода)
	|			И (Договоры.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ Договоры.ДатаОкончанияДействия > &НачалоПериода)
	|			И (НЕ Договоры.ПометкаУдаления)
	|ГДЕ
	|	(Контрагенты.Ссылка В ИЕРАРХИИ (&СписокДепонентов)
	|			ИЛИ &СписокДепонентовПуст)
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Субклиенты.Клиент КАК Субклиент,
	|	МАКСИМУМ(Контрагенты.Ссылка) КАК КонтрагентСубклиента,
	|	Субклиенты.Объект КАК ДУ,
	|	втДепоненты.Договор КАК ДоговорДУ
	|ПОМЕСТИТЬ втСубклиенты
	|ИЗ
	|	втДепоненты КАК втДепоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Субклиенты КАК Субклиенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО (Контрагенты.ЮридическиеФизическиеЛица = Субклиенты.Клиент)
	|		ПО втДепоненты.Депонент = Субклиенты.Объект
	|ГДЕ
	|	(Субклиенты.Клиент В (&СписокСубклиентов)
	|			ИЛИ &СписокСубклиентовПуст)
	|
	|СГРУППИРОВАТЬ ПО
	|	Субклиенты.Объект,
	|	Субклиенты.Клиент,
	|	втДепоненты.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент КАК Субклиент,
	|	КонтактнаяИнформация.Период КАК ДатаАдресФакт,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаАдресЮр,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаЭлПочта,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаТелефон,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаФИО,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПаспортныеДанные,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаГражданство,
	|	втСубклиенты.КонтрагентСубклиента КАК КонтрагентСубклиента
	|ПОМЕСТИТЬ втСубклиентыДатыИзменений
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втСубклиенты.Субклиент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &Адрес)
	|			И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И КонтактнаяИнформация.Вид = &ФактАдресЮрЛица
	|				ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И КонтактнаяИнформация.Вид = &ФактАдресФизЛица)
	|			И (КонтактнаяИнформация.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	КонтактнаяИнформация.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втСубклиенты.Субклиент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &Адрес)
	|			И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И КонтактнаяИнформация.Вид = &ЮрАдресЮрЛица
	|				ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И КонтактнаяИнформация.Вид = &ЮрАдресФизЛица)
	|			И (КонтактнаяИнформация.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	КонтактнаяИнформация.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втСубклиенты.Субклиент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &АдресЭлектроннойПочты)
	|			И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И КонтактнаяИнформация.Вид = &EmailЮрЛица
	|				ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И КонтактнаяИнформация.Вид = &EmailФизЛица)
	|			И (КонтактнаяИнформация.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	КонтактнаяИнформация.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО втСубклиенты.Субклиент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = &Телефон)
	|			И (КонтактнаяИнформация.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И КонтактнаяИнформация.Вид = &ТелефонЮрЛица
	|				ИЛИ КонтактнаяИнформация.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И КонтактнаяИнформация.Вид = &ТелефонФизЛица)
	|			И (КонтактнаяИнформация.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ФИОФизЛиц.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
	|		ПО втСубклиенты.Субклиент = ФИОФизЛиц.ФизЛицо
	|			И (втСубклиенты.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|			И (ФИОФизЛиц.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ПаспортныеДанныеФизЛиц.Период,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц
	|		ПО втСубклиенты.Субклиент = ПаспортныеДанныеФизЛиц.ФизЛицо
	|			И (втСубклиенты.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|			И (ПаспортныеДанныеФизЛиц.Период <= &КонецПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втСубклиенты.Субклиент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ГражданствоФизЛиц.Период,
	|	втСубклиенты.КонтрагентСубклиента
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО втСубклиенты.Субклиент = ГражданствоФизЛиц.ФизЛицо
	|			И (втСубклиенты.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|			И (ГражданствоФизЛиц.Период <= &КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыИзменений.ДатаИзменений КАК ДатаИзменений,
	|	ДатыИзменений.Субклиент КАК Субклиент,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаАдресФакт) КАК ДатаАдресФакт,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаАдресЮр) КАК ДатаАдресЮр,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаЭлПочта) КАК ДатаЭлПочта,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаТелефон) КАК ДатаТелефон,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаФИО) КАК ДатаФИО,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаПаспортныеДанные) КАК ДатаПаспортныеДанные,
	|	МАКСИМУМ(втСубклиентыДатыИзменений.ДатаГражданство) КАК ДатаГражданство,
	|	втСубклиентыДатыИзменений.КонтрагентСубклиента КАК КонтрагентСубклиента
	|ПОМЕСТИТЬ втСубклиентыДатыИзмененийИАктуальности
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВЫБОР
	|			КОГДА втСубклиентыДатыИзменений.ДатаАдресФакт <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаАдресФакт
	|			КОГДА втСубклиентыДатыИзменений.ДатаАдресЮр <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаАдресЮр
	|			КОГДА втСубклиентыДатыИзменений.ДатаЭлПочта <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаЭлПочта
	|			КОГДА втСубклиентыДатыИзменений.ДатаТелефон <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаТелефон
	|			КОГДА втСубклиентыДатыИзменений.ДатаФИО <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаФИО
	|			КОГДА втСубклиентыДатыИзменений.ДатаПаспортныеДанные <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаПаспортныеДанные
	|			КОГДА втСубклиентыДатыИзменений.ДатаГражданство <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА втСубклиентыДатыИзменений.ДатаГражданство
	|		КОНЕЦ КАК ДатаИзменений,
	|		втСубклиентыДатыИзменений.Субклиент КАК Субклиент
	|	ИЗ
	|		втСубклиентыДатыИзменений КАК втСубклиентыДатыИзменений
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&НачалоПериода,
	|		втСубклиенты.Субклиент
	|	ИЗ
	|		втСубклиенты КАК втСубклиенты) КАК ДатыИзменений
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСубклиентыДатыИзменений КАК втСубклиентыДатыИзменений
	|		ПО ДатыИзменений.Субклиент = втСубклиентыДатыИзменений.Субклиент
	|			И (втСубклиентыДатыИзменений.ДатаАдресФакт <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаАдресФакт <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаАдресЮр <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаАдресЮр <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаЭлПочта <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаЭлПочта <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаТелефон <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаТелефон <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаФИО <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаФИО <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаПаспортныеДанные <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаПаспортныеДанные <> ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ втСубклиентыДатыИзменений.ДатаГражданство <= ДатыИзменений.ДатаИзменений
	|					И втСубклиентыДатыИзменений.ДатаГражданство <> ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	ДатыИзменений.ДатаИзменений >= &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыИзменений.ДатаИзменений,
	|	ДатыИзменений.Субклиент,
	|	втСубклиентыДатыИзменений.КонтрагентСубклиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСубклиентыДатыИзмененийИАктуальности.Субклиент КАК Субклиент,
	|	втСубклиентыДатыИзмененийИАктуальности.ДатаИзменений КАК ДатаИзменения,
	|	ЕСТЬNULL(ЮридическиеАдреса.Представление, """") КАК ЮридическийАдрес,
	|	ЕСТЬNULL(ФактическиеАдреса.Представление, """") КАК ФактическийАдрес,
	|	ЕСТЬNULL(АдресаЭлПочты.Представление, """") КАК АдресЭлектроннойПочты,
	|	ЕСТЬNULL(Телефоны.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(ФИОФизЛиц.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ФИОФизЛиц.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИОФизЛиц.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(Паспорт.ДокументВид, """") КАК ДокументВид,
	|	ЕСТЬNULL(Паспорт.ДокументСерия, """") КАК ДокументСерия,
	|	ЕСТЬNULL(Паспорт.ДокументНомер, """") КАК ДокументНомер,
	|	ЕСТЬNULL(Паспорт.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументДатаВыдачи,
	|	ЕСТЬNULL(Паспорт.ДокументКемВыдан, """") КАК ДокументКемВыдан,
	|	ЕСТЬNULL(Паспорт.ДокументКодПодразделения, """") КАК ДокументКодПодразделения,
	|	ЕСТЬNULL(Гражданство.Страна.Наименование, """") КАК Гражданство,
	|	втСубклиентыДатыИзмененийИАктуальности.Субклиент.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА НЕ втСубклиентыДатыИзмененийИАктуальности.Субклиент.НеРезидент
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА НЕ ЕСТЬNULL(втСубклиентыДатыИзмененийИАктуальности.КонтрагентСубклиента.Резидент, ЛОЖЬ)
	|	КОНЕЦ КАК Резидент,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(втСубклиентыДатыИзмененийИАктуальности.Субклиент.ПолноеНаименование КАК СТРОКА(255))
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент.Наименование
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент.ОГРН
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОГРН,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент.ДатаГосРегистрации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаГосРегистрации,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент.ДатаРождения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаРождения,
	|	ВЫБОР
	|		КОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА втСубклиентыДатыИзмененийИАктуальности.Субклиент.МестоРождения
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК МестоРождения,
	|	втСубклиентыДатыИзмененийИАктуальности.Субклиент.Наименование КАК КраткоеНаименование,
	|	втСубклиентыДатыИзмененийИАктуальности.КонтрагентСубклиента КАК КонтрагентСубклиента
	|ИЗ
	|	втСубклиентыДатыИзмененийИАктуальности КАК втСубклиентыДатыИзмененийИАктуальности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ФактическиеАдреса
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = ФактическиеАдреса.Объект
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаАдресФакт = ФактическиеАдреса.Период
	|			И (ФактическиеАдреса.Тип = &Адрес)
	|			И (ФактическиеАдреса.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И ФактическиеАдреса.Вид = &ФактАдресЮрЛица
	|				ИЛИ ФактическиеАдреса.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И ФактическиеАдреса.Вид = &ФактАдресФизЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ЮридическиеАдреса
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = ЮридическиеАдреса.Объект
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаАдресЮр = ЮридическиеАдреса.Период
	|			И (ЮридическиеАдреса.Тип = &Адрес)
	|			И (ЮридическиеАдреса.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И ЮридическиеАдреса.Вид = &ЮрАдресЮрЛица
	|				ИЛИ ЮридическиеАдреса.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И ЮридическиеАдреса.Вид = &ЮрАдресФизЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаЭлПочты
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = АдресаЭлПочты.Объект
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаЭлПочта = АдресаЭлПочты.Период
	|			И (АдресаЭлПочты.Тип = &АдресЭлектроннойПочты)
	|			И (АдресаЭлПочты.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И АдресаЭлПочты.Вид = &EmailЮрЛица
	|				ИЛИ АдресаЭлПочты.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И АдресаЭлПочты.Вид = &EmailФизЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефоны
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = Телефоны.Объект
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаТелефон = Телефоны.Период
	|			И (Телефоны.Тип = &Телефон)
	|			И (Телефоны.Объект ССЫЛКА Справочник.ЮридическиеЛица
	|					И Телефоны.Вид = &ТелефонЮрЛица
	|				ИЛИ Телефоны.Объект ССЫЛКА Справочник.ФизическиеЛица
	|					И Телефоны.Вид = &ТелефонФизЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = ФИОФизЛиц.ФизЛицо
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаФИО = ФИОФизЛиц.Период
	|			И (втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = Гражданство.ФизЛицо
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаГражданство = Гражданство.Период
	|			И (втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц КАК Паспорт
	|		ПО втСубклиентыДатыИзмененийИАктуальности.Субклиент = Паспорт.ФизЛицо
	|			И втСубклиентыДатыИзмененийИАктуальности.ДатаПаспортныеДанные = Паспорт.Период
	|			И (втСубклиентыДатыИзмененийИАктуальности.Субклиент ССЫЛКА Справочник.ФизическиеЛица)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Субклиент,
	|	ДатаИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСубклиенты.ДУ КАК ДУ,
	|	втСубклиенты.Субклиент КАК Субклиент,
	|	втСубклиенты.КонтрагентСубклиента КАК КонтрагентСубклиента,
	|	втСубклиенты.ДоговорДУ КАК ДоговорДУ
	|ИЗ
	|	втСубклиенты КАК втСубклиенты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Субклиент,
	|	втСубклиенты.ДоговорДУ.Код,
	|	втСубклиенты.ДУ.Наименование";
	
КонецФункции

Функция СтрокаИзДаты(Дата)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Возврат Формат(Дата, "ДФ=dd.MM.yyyy");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеГражданстваФизлица(ФизЛицо, Гражданство, Дата)
	
	СтрокаРезультат = "";
	Если ЗначениеЗаполнено(Гражданство) Тогда
		СтрокаРезультат = СокрЛП(Гражданство);
	Иначе
		ТекстСообщения = "Для физ.лица " + СокрЛП(ФизЛицо) + " на " + Формат(Дата, "ДЛФ=Д") + " не указано гражданство!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	Возврат СтрокаРезультат;
	
КонецФункции

Функция ПредставлениеДокументаФизлица(ФизЛицо, ДанныеДокумента, Дата)
	
	СтрокаРезультат = "";
	Если ЗначениеЗаполнено(ДанныеДокумента.ДокументВид) Тогда
		СтрокаРезультат = 
		?(ДанныеДокумента.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ИМНС21, "Паспорт РФ", СокрЛП(ДанныеДокумента.ДокументВид))
		+ ?(ЗначениеЗаполнено(ДанныеДокумента.ДокументСерия), " серия " + ДанныеДокумента.ДокументСерия, "")
		+ " № " + ДанныеДокумента.ДокументНомер
		+ ", выдан " + Формат(ДанныеДокумента.ДокументДатаВыдачи, "ДФ='дд ММММ гггг';ДП='...'") + " г. " 
		+ ДанныеДокумента.ДокументКемВыдан
		+ ?(ЗначениеЗаполнено(ДанныеДокумента.ДокументКодПодразделения), ", № подр. " + ДанныеДокумента.ДокументКодПодразделения, "");
	Иначе
		ТекстСообщения = "Для физ.лица " + СокрЛП(ФизЛицо) + " на " + Формат(Дата, "ДЛФ=Д") + " не указан вид документа!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат СтрокаРезультат;
КонецФункции

Функция ОГРН(ОГРН, ДатаГосРегистрации, Резидент)
	
	СтрокаРезультат = "";	
	Если ЗначениеЗаполнено(ОГРН) Тогда
		СтрокаРезультат = ?(Резидент, "ОГРН ", "") + СокрЛП(ОГРН);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаГосРегистрации) Тогда
		СтрокаРезультат = ?(ЗначениеЗаполнено(СтрокаРезультат), СтрокаРезультат + " ", "")
			+ "Дата регистрации " + СтрокаИзДаты(ДатаГосРегистрации);
	КонецЕсли;
	Возврат СтрокаРезультат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
